Revit 2027 API
ParameterTypeId.RoofLevelOffsetParam Property
 "Base Offset From Level"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoofLevelOffsetParam { get; }
Public Shared ReadOnly Property RoofLevelOffsetParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoofLevelOffsetParam {
	ForgeTypeId^ get ();
}
static member RoofLevelOffsetParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace